import React, { useState, useEffect, useRef } from 'react';
import ReactToPrint from 'react-to-print';

import './Sifaris.css'

const StudentList = () => {
  const componentRef = useRef();
  const [students, setStudents] = useState([]);

  useEffect(() => {
    const fetchStudents = async () => {
      try {
        const response = await fetch('https://palika-production.up.railway.app/getUsers');
        if (!response.ok) {
          throw new Error('Failed to fetch student data');
        }
        const data = await response.json();
        setStudents(data); // Update state with fetched data
      } catch (error) {
        console.error('Error fetching student data:', error);
        // Handle error (e.g., show error message)
      }
    };

    fetchStudents();
  }, []); // Empty dependency array ensures effect runs only once

  return (
    <div>
      <div>
        {students.map(student => (
          <div key={student._id}>
            <div className='container__karar'ref={componentRef}>
            <div className='karar__title'>
                <h2> <u>करार सम्झौता नविकरण </u> </h2>
            </div>
            <div className='karar__body'>
                <p>फिदिम नगरपालिका, नगर  कार्यपालिकाको कार्यालय, (यसपछि पहिलो पक्ष भनिएको) र {student.district}  जिल्ला {student.municipality} -{student.ward} बस्ने श्री {student.name} (यसपछि दोस्रो पक्ष भनिएको) का बीच कार्यालय सहयोगी पदमा कामकाज गर्न गराउन फिदिम नगरपालिकाको करारमा कर्मचारी व्यवस्थापन गर्ने कार्यविधि, २०७५ को दफा ७ को उपदफा  (१) र नगर कार्यपालिकाको मिति २०८१ असार २३ गते को निर्णय बमोजिम देहायका शर्तको अधीनमा रही दोस्रो पक्षले पहिलो पक्षलाई सेवा उपलब्ध गराउन मन्जुर भई यो सेवा करारको सम्झौतामा दस्तखत गरी एक/एक प्रति आपसमा बुझि लियौं/दियौ । </p>
                <h5>शर्तहरुः</h5>
                <p>१.<strong>गर्नुपर्ने कामः</strong> पहिलो पक्षले तोकिदिएको कार्य विवरण अनुसारको कार्य दोस्रो पक्षले गर्नुपर्नेछ । </p>
                <p>२.<strong>काम गर्नुपर्ने स्थान र समयः</strong> पहिलो पक्षले तोकेको समय र स्थानमा उपस्थित भई दोस्रो पक्षले कार्य गर्नुपर्नेछ।</p>
                <p>३.<strong>पारिश्रमिक तथा अन्य सुविधाः</strong> </p>
                 <strong>सेवा शर्तः</strong>  सेवा प्रदान गरे बापत पारिश्रमिक रकम  नेपाल सरकारले तोकेको स्केल अनुसार नियमानुसार कर कट्टी गरी मासिक रुपमा पहिलो पक्षले दोस्रो पक्षलाई उपलब्ध गराउने छ ।
                <p>क.एक पटक चाडवाड खर्च करार अनधिमा उपलब्ध  हुनेछ।</p>
                <p>ख.दोस्रो पक्षलाई सार्वजनिक विदा बाहेक करार सम्झौता अवधिभर सञ्चित हुने गरी मासिक रुपमा एक दिन घर विदा, नियमानुसार प्रसूति /प्रसूती स्याहार विदा र प्रचलित परम्परा अनुसार मृत्यु संस्कार बिदा उपलब्ध हुनेछ ।</p>
                <p>ग.दोस्रो पक्षले सरकारी कामकाजमा खटिएमा नियमानुसार दैनिक तथा भ्रमण भत्ता पाउनेछ ।</p>
                <p>घ.दोस्रो पक्षले उल्लेखित सुविधा भन्दा थप सुविधा दाबी गर्न पाउने छैन ।</p>
                <p>४.आचरणको पालनाः दोस्रो पक्षले प्रचलित कानूनमा व्यवस्था भएका आचरण तथा अनुशासन सम्बन्धी व्यवस्थाहरु पालना गर्नुपर्नेछ ।</p> 
                <p>५.कार्यालयको सम्पत्तिको सुरक्षाः दोस्रो पक्षले कार्यालयको चल/अचल सम्पत्तिको हानीनोक्सानी वा हिनामिना गरेमा सोको क्षतिपूर्ति वा हानीनोक्सानीको बिगो दोस्रो पक्षले पहिलो पक्षलाई दिनुपर्नेछ।</p>
                <p>६.गोपनीयताः दोस्रो पक्षले कार्यालयको काम सम्बन्धी कुरा अनाधिकृत व्यक्त्ति वा निकायलाई गैरकानुनी तरिकाले उपलब्ध गराएको प्रमाणित भएमा दोस्रो पक्षलाई सेवाबाट हटाई सोबाट भएको हानी नोक्सानीको क्षतिपूर्ती दोस्रो पक्षबाट भराइनेछ ।</p>
                <p>७.कार्य सम्पदान मूल्याङ्कनः पहिलो पक्षले दोस्रो पक्षको कार्य सम्पदान मूल्याङ्कन प्रचलित कानून बमोजिम गर्नेछ।</p>
                <p>८.दावी नपुग्नेः दोस्रो पक्षले यस करार बमोजिम काम गरेकै आधारमा पछि कुनै पनि पदमा अस्थायी वा स्थायी नियुक्त्ति हुनको लागि दाबी गर्न पाउने छैन ।</p>
                <p>९.सम्झौता रद्द हुने अवस्थाः </p>
	                क) बारम्बार मादक पदार्थ सेवन गरी कार्यालयमा उपस्थित भएमा । 	ङ) प्रचलित कानूनले निषेध गरेका कार्य गरेमा ।
	                ख) कार्यसम्पादन मूल्याङ्कन बमोजिम काम सन्तोषजनक नभएमा ।	च)  राजनीतिमा भाग लिएमा । 
	                ग) विदा स्वीकृत नगराई सात दिन सम्म कार्यालयमा अनुपस्थित भएमा ।	छ) सो पदमा स्थायी पदपूर्ति भई आएमा । 
	                घ) शारीरिक रुपमा अस्वस्थ भई वा अन्य कुनै कारणले सेवा दिन असमर्थ भएमा ।
                <p>१०.करार अवधिः यो करार २०८१ साउन १ गते देखि लागू भई २०८१ पौष मसान्त सम्म हुनेछ । कार्यसम्पादन मूल्याङ्कन बमोजिम काम सन्तोषजनक भएमा सम्झौता नवीकरण हुन सक्नेछ ।</p>
                <p>११.अन्यः यस सम्झौतामा उल्लेख भएका कुरा यसै बमोजिम र उल्लेख नभएको कुरा प्रचलित कानुन बमोजिम हुनेछ ।</p>

            </div>
            <div className='karar__footer'>
            <div className='kara__first'>
                <h4>पहिलो पक्ष (नगरपालिकाको तर्फबाट)</h4>
                <p>हस्ताक्षरः</p>
                <p>नामः कुमार प्रसाद भट्टराई</p>
                <p>पदःप्रमुख प्रशासकीय अधिकृत</p>
                <p>कार्यालयको छापः</p>
                <p>साक्षीः भुवन कुमार शाही,अधिकृत सातौं</p>
                <p>हस्ताक्षरः</p>
            </div>
            <div className='karar__second'>
            <h4>दोस्रो पक्ष (करार गर्ने व्यक्ति)</h4>
                <p>हस्ताक्षरः</p>
                <p>नामः {student.name} </p>
                <p>पदः कार्यालय सहयोगी</p>
                <p>ठेगानाः{student.municipality}-{student.ward}, {student.district}</p>
                <p>साक्षीः {student.sakchi} </p>
                <p>हस्ताक्षरः</p>
            </div>
            </div>
            <div className='isbi__karar'>ईती संवत २०८१  साउन महिनाको  १  गते रोज ३ शुवम्  </div>

            </div>
            <ReactToPrint
        trigger={() => <button>Print this out!</button>}
        content={() => componentRef.current}
      />
            {/* <strong>Name:</strong> {student.name} <br />
            <strong>Email:</strong> {student.email} <br />
            <strong>Phone:</strong> {student.phone} <br />
            <strong>Address:</strong> {student.address} <br /> */}
          </div>


        ))}
      </div>
    </div>
  );
};

export default StudentList;
